import React from "react";
import Layout from "../Layout/Layout";

const AboutPage = () => {
  return (
    <Layout>
      "Суші з любов'ю"- любов у кожному шматочку! Саме так звучить девіз нашого
      закладу...унікальне поєднання інгредієнтів, авторські рецепти і смак, не
      схожий на будь-що інше...це все Ви знайдете у нас. Ми готуємо для Вас з
      любов'ю і душею, адже тільки так можна створити не лише ідеальний смак
      наших страв, але і отримати максимальне естетичне задоволення від
      продукту! Від часу відкриття ми завоювали багато прихильників і стараємось
      і надалі тішити Вас цікавими новинками, акційними пропозиціями і затишною
      атмосферою у нашому закладі. Наша кухня відкрита для Ваших поглядів, адже
      нам немає чого приховувати. Ми дбаємо про високу якість продуктів та
      чистоту робочого місця. Ви можете бути впевнені на 100% у свіжості наших
      страв, адже усі замовлення готуються "з-під ножа". У нас Ви можете знайти
      різноманітний вибір ролів, сетів, пивних дошок, а також смачне розливне
      пиво, сидр і коктейлі на будь-який смак! Ми надзвичайно любимо наших
      гостей і робимо усе для того, аби Ви полюбили і нас :)
    </Layout>
  );
};

export default AboutPage;
